"""
По предложенной выборке постройте гистограмму, используя интервалы
[15, 15.75], (15.75, 16.5], (16.5, 17.25], (17.25, 18.0], (18.0, 18.75], (18.75, 19.5], (19.5, 20.25], (20.25, 21.0]
Найдите относительные частоты попадания элементов выборки в данные интервалы.

Формат ответа: относительные частоты с точностью до третьего знака после запятой через запятую с пробелом

Sample Input:
18.55, 16.5, 18.09, 19.17, 17.09, 18.16, 16.09, 18.79, 17.44, 17.92

Sample Output:
0.000, 0.200, 0.100, 0.200, 0.300, 0.200, 0.000, 0.000
"""

bounds = [15.75, 16.5, 17.25, 18.0, 18.75, 19.5, 20.25, 21.0]
frequencies = []

X = [19.55, 17.64, 18.16, 18.66, 18.09, 19.08, 18.01, 17.5, 19.09, 16.57, 16.53, 17.24, 17.35, 18.56, 17.83, 18.68, 18.35, 18.53, 18.63, 17.03, 17.1, 18.15, 18.19, 18.78, 17.35, 17.59, 18.2, 18.53, 17.52, 18.44, 17.68, 19.83, 20.9, 17.69, 18.22, 17.25, 18.67, 18.97, 18.38, 17.33]

for bound in bounds:
    f = 0
    for x in X:
        if x <= bound:
            f = f + 1
    frequencies.append(f)

for i in range(len(frequencies)-1, 0, -1):
    frequencies[i] = frequencies[i] - frequencies[i - 1]

for i in range(len(frequencies)):
    frequencies[i] = frequencies[i] / len(X)

print(frequencies)